{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 480, 640, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "convoluton_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convoluton_1", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "activation_1", "inbound_nodes": [[["convoluton_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convolution_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convolution_2", "inbound_nodes": [[["pooling_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "activation_2", "inbound_nodes": [[["convolution_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convolution_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convolution_3", "inbound_nodes": [[["pooling_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "activation_3", "inbound_nodes": [[["convolution_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convolution_4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convolution_4", "inbound_nodes": [[["pooling_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "activation_4", "inbound_nodes": [[["convolution_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling_4", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convolition_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convolition_5", "inbound_nodes": [[["pooling_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "activation_5", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "activation_5", "inbound_nodes": [[["convolition_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling_5", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convolution_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convolution_6", "inbound_nodes": [[["pooling_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "activation_6", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "activation_6", "inbound_nodes": [[["convolution_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling_6", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling_6", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["pooling_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense1", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["dense1", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["output", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.004999999888241291, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "convolition_5/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "convolition_5/bias", "shape": [64], "dtype": "float32"}, {"name": "convolution_2/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "convolution_2/bias", "shape": [16], "dtype": "float32"}, {"name": "convolution_3/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "convolution_3/bias", "shape": [32], "dtype": "float32"}, {"name": "convolution_4/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "convolution_4/bias", "shape": [32], "dtype": "float32"}, {"name": "convolution_6/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "convolution_6/bias", "shape": [64], "dtype": "float32"}, {"name": "convoluton_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "convoluton_1/bias", "shape": [16], "dtype": "float32"}, {"name": "dense1/kernel", "shape": [4480, 32], "dtype": "float32"}, {"name": "dense1/bias", "shape": [32], "dtype": "float32"}, {"name": "output/kernel", "shape": [32, 1], "dtype": "float32"}, {"name": "output/bias", "shape": [1], "dtype": "float32"}]}]}